Спортклуб/src/Documents/ПродажаТовара/ПродажаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТовара</name>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
</mdclass:Document>

Спортклуб/src/InformationRegisters/ЦенаТовара/ЦенаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦенаТовара</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Спортклуб/src/InformationRegisters/НаценкаТовара/НаценкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НаценкаТовара</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ПроцентНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Спортклуб/src/Documents/Оплата/Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Оплата</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаАбонемента</types>
      <types>DocumentRef.ПродажаТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Абонемент</name>
      <type>
        <types>CatalogRef.Товары</types>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Спортклуб/src/Documents/ПродажаТовара/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Оплатить(Команда)
	Если Не Объект.Проведен Тогда
        ВызватьИсключение(, "Документ должен быть проведен перед оплатой");
	КонецЕсли;
    ПараметрыФормы = Новый Структура; 
    ПараметрыФормы.Вставить("Основание", Объект.Ссылка); 
    ОткрытьФорму("Документ.Оплата.Форма.ФормаДокумента", ПараметрыФормы); 
КонецПроцедуры


&НаКлиенте
Процедура ТоварЦенаПродажиПриИзменении(Элемент)
	Количество = Элементы.Товар.ТекущиеДанные.Количество;
	Цена = Элементы.Товар.ТекущиеДанные.ЦенаПродажи;
	Элементы.Товар.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуТовара(Товар, Дата)
	Отбор = Новый Структура("Товар", Товар);
	ЦенаТовара = РегистрыСведений.ЦенаТовара.ПолучитьПоследнее(Дата, Отбор);	
	СтоимостьТовара = ЦенаТовара.Цена;
	
	Отбор = Новый Структура("Товар", Товар);
	Наценка = РегистрыСведений.НаценкаТовара.ПолучитьПоследнее(Дата, Отбор);	
	ПроцентНаценки = Наценка.ПроцентНаценки; 
	
	Цена = СтоимостьТовара + (СтоимостьТовара * (ПроцентНаценки / 100));
	Возврат цена
КонецФункции

&НаКлиенте
Процедура ТоварКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товар.ТекущиеДанные.Товар;
	Дата = Объект.Дата;
	Цена = ПолучитьЦенуТовара(Товар, Дата);
	Элементы.Товар.ТекущиеДанные.ЦенаПродажи = Цена;
	Количество = Элементы.Товар.ТекущиеДанные.Количество;
	Элементы.Товар.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры
